# 3. Написать программу, которая генерирует в указанных пользователем границах:
# a. случайное целое число,
# b. случайное вещественное число,
# c. случайный символ.
from random import random

if __name__ == '__main__':
    print('Генерация случайного целого числа в указанных границах.')
    lb: int = int(input('Введите нижнюю границу: '))
    ub: int = int(input('Введите верхнюю границу: '))
    n: int = int(random() * (ub - lb + 1)) + lb
    print(f'Случайное целое число: {n}')

    print('Генерация случайного вещественного числа в указанных границах.')
    lb: float = float(input('Введите нижнюю границу: '))
    ub: float = float(input('Введите верхнюю границу: '))
    n: float = random() * (ub - lb) + lb
    print(f'Случайное целое число: {round(n, 4)}')

    print('Генерация случайного символа в указанных границах.')
    lb: int = ord(input('Введите нижнюю границу: '))
    ub: int = ord(input('Введите верхнюю границу: '))
    n: int = int(random() * (ub - lb + 1)) + lb
    print(f'Случайное символ: {chr(n)}')
