# 6. По длинам трех отрезков, введенных пользователем,
# определить возможность существования треугольника, составленного из этих отрезков.
# Если такой треугольник существует, то определить,
# является ли он разносторонним, равнобедренным или равносторонним.

if __name__ == '__main__':
    a: int = int(input('Введите длину 1-го отрезка: '))
    b: int = int(input('Введите длину 2-го отрезка: '))
    c: int = int(input('Введите длину 3-го отрезка: '))

    if (a + b <= c) or (a + c <= b) or (b + c <= a):
        print('Треугольник не существует')
    elif (a != b) and (a != c) and (b != c):
        print('Треугольник разносторонним')
    elif a == b == c:
        print('Треугольник равносторонним')
    else:
        print('Треугольник равнобедренным')
