# 5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

if __name__ == '__main__':
    n: int = int(input('Введите номер буквы в алфавите: '))
    pos_n: int = ord('a') + n - 1
    print(f'Номер {n} соответствует букве: {chr(pos_n)}')
