# 4. Пользователь вводит две буквы. Определить, на каких местах алфавита они стоят,
# и сколько между ними находится букв.

if __name__ == '__main__':
    a: str = input('Введите 1-ую букву: ')
    b: str = input('Введите 2-ую букву: ')
    pos_a: int = ord(a) - ord('a') + 1
    pos_b: int = ord(b) - ord('a') + 1
    print(f'Букв {a} в алфавите находится на позиции: {pos_b}')
    print(f'Букв {b} в алфавите находится на позиции: {pos_a}')
    print(f'Между буквами {a} и {b} нвходится символов: {abs(pos_a - pos_b) - 1}')
