# 8. Вводятся три разных числа. Найти, какое из них является средним (больше одного, но меньше другого).

if __name__ == '__main__':
    a: int = int(input('Введите 1-ое число: '))
    b: int = int(input('Введите 2-ое число: '))
    c: int = int(input('Введите 3-е число: '))

    if (b < a < c) or (c < a < b):
        print(f'Средним из {a}, {b} и {c} является: {a}')
    elif (a < b < c) or (c < b < a):
        print(f'Средним из {a}, {b} и {c} является: {b}')
    else:
        print(f'Средним из {a}, {b} и {c} является: {c}')
