# 7. Написать программу, доказывающую или проверяющую,
# что для множества натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
# где n — любое натуральное число.

if __name__ == '__main__':
    n: int = int(input('Введите натуральное число: '))
    s: int = 0
    for i in range(1, n + 1):
        s += i
    m: int = int(n * (n + 1) // 2)
    print(f'1+2+...+n = n(n+1)/2 => {s} = {m}: {s == m}')
