# 6. В программе генерируется случайное целое число от 0 до 100.
# Пользователь должен его отгадать не более чем за 10 попыток.
# После каждой неудачной попытки должно сообщаться,
# больше или меньше введенное пользователем число, чем то, что загадано.
# Если за 10 попыток число не отгадано, вывести ответ.
import random

if __name__ == '__main__':
    n: int = random.randint(0, 100)
    i: int = 0
    print('Компьютер сгенерировал случайное целое число от 0 до 100,'
          'попробуйте отгадать его не более чем за 10 попыток.')
    user_number: int = 0
    while i < 10:
        user_number = int(input(f'{i + 1}-я попытка, введите число: '))
        if user_number > n:
            print(f'Введенное число {user_number} больше загаданного')
        elif user_number < n:
            print(f'Введенное число {user_number} меньше загаданного')
        else:
            print(f'Вы угадали число с {i + 1} попытки, было загадано число: {n}')
            break
        i += 1
    else:
        print(f'Попытки закончились, было загадано число: {n}')
