# 1. Написать программу, которая будет складывать, вычитать, умножать или делить два числа.
# Числа и знак операции вводятся пользователем. После выполнения вычисления программа не завершается,
# а запрашивает новые данные для вычислений.
# Завершение программы должно выполняться при вводе символа '0' в качестве знака операции.
# Если пользователь вводит неверный знак (не '0', '+', '-', '', '/'),
# программа должна сообщать об ошибке и снова запрашивать знак операции.
# Также она должна сообщать пользователю о невозможности деления на ноль, если он ввел его в качестве делителя.

if __name__ == '__main__':
    while True:
        s: str = input('Введите знак операции (+, -, *, /) для продолжения или 0 для выхода: ')
        if s == '0':
            print('Выход из программы..')
            break
        if s in ('+', '-', '*', '/'):
            x: float = float(input('Введите 1-ое число: '))
            y: float = float(input('Введите 2-ое число: '))
            if s == '+':
                print(f'{x} {s} {y} = {x + y}')
            elif s == '-':
                print(f'{x} {s} {y} = {x - y}')
            elif s == '*':
                print(f'{x} {s} {y} = {x * y}')
            elif s == '/':
                if y != 0:
                    print(f'{x} {s} {y} = {x / y}')
                else:
                    print(f'Вы ввели {y} в качестве делителя. Деление на ноль невозможно!')
        else:
            print('Вы ввели неверный знак операции!')
